
# -*- coding: utf-8 -*-

def Bigdata():
    sentence = u"""녹번동 길 막히나요     룸카페    맛집 추천   에 미녀와야수 초커 파나요?    입니다 
음식점겸술집 오픈준비중  새벽시간 n버스이용   -천호  서울시 은평구 대조동      부평 VS         
성환  소요 시간  신사      가는 3호선    인천공항 2터미널 버스 없나요?    수노래방 가격     
일산 cgv 지하철타고   치아교정 조언 부탁 3호선 독립문      출근   치아교정 하려고 합니다!   
치과 급하게 알아보는데요  아라아트센터 가야하는데       피부과 추천해주실분   치아교정 어디로 다녀야 할까요   
교정치과 어디 나을까요..     신설동7211막차시간 알려주세요   치아교정 믿고 맡길곳 중구,종로구 홍제,녹번,      단국대 죽전 가는방법     
갈만한 곳 안녕하세요 초6    비뇨기과 조루수술 잘하는 곳 알려주세요.   치아교정 어디서 하셨나요    피부과 어디로?   치과 어디가 좋은가요?  
여드름 어떻게 해야 할까요?ㅠㅠ 서울 남부터미널       55번 뻐스를 타고     대화   비만클리닉 추천 서울 불광동?    가까운 힘찬병원 어딘가요?
행신동 가는 버스 알려주세요   치과 찾아요     신촌연세병원가는버스..     치아교정 어떨까요?    치과 알려주세요!!    피부관리 원하는데    
유명한 횟집 있나요??  화정터미널 →    연세알찬정형외과 가는법     피부과 괜찮은 곳 추천받습니다!    치과 가보신분  질문 
신촌미용학원 수강료질문!!    치과 알아봅니다~      회식장소 추천부탁드려요!  이번에   지 조합주택 계약을생각하    치아교정 질문이요~  
치과 추천 부탁해요    주변 걸을곳    치아교정    부근에서 찾아요  불광    쪽에 점 잘 빼주는곳 있  걸포동오스타파라곤  
노량진   까지 어떻게가요?    교정치과 어디로 갈지요..?    서 이대가는법 알려주세요     트리플파크 지 주택조합 2차분   
피부과 점 잘빼는곳 알려주세요     룸술집or조용한술집    치아교정 어디로 가야하나용    다이어트 알아보고 있는데 추천해주세요!   
쿠우쿠우     필라테스 궁금해요   피부과 다녀와서      부천원종사거리 출근시간    치아교정 부정교합문의   치과 전문으로~  
치과 어디로 갈까요?   치과 어디로 가면 좋을까요?   산부인과 알아보고 있는 중입니다.     얼굴 점 제거 저렴하게 하는곳좀 알려주세요   
대천라보용달 제일    치과 궁금해집니다~    고양어울림누리 가는방법    치과 은평구치아교정은?    치과 추천해주세요!!     
북한산성 쪽 가는 버스번호 좀   치과 실력있는데로 찾아요!   치아교정 양심적인곳 어디인가요?   교정치과 어디로 갈까유?   
치아교정 알아보고 있는데 어디가 잘할까요?    치아교정 잘해주는곳?    치아교정 야간진료 어디없나요?    치과 다니시는 분들!   
임플란트 잘하는곳좀 알랴주삼!    치과 잘 알려주실 분 ^^    치과 정보 많이 아시면     vr 방탈출카페 가격 할인 좀 알려주세여  
치과 양심적인곳 아시는 분~     헌혈의집 서울   쪽에 중고폰가게 잇나요?    치과 잘 아시는 분    운전면허학원 궁금해요   
도그원 관한 질문  창동    서울  더헤어 어떤가요(내공)    치아교정 치과 청소년 다닐만한 곳 운정    미용학원 추천 부탁드립니다!!  
치아교정 잘좀 알려주세요~ 홍제      디팡   지하철 타고  법  ♡ 근처 공영주차장 ? 의정부 제2청사   방법      근처일반외과 잠실           지하철 막차시간
 가락시장       새벽에  법.     이삭토스트점이  ?     가산디지털단지       다이어트 알아보고 있는데 추천해주세요!    치과   ~
 갈현동_      국민대      방법  강남고속터미널      갈려면    가야  ?      4번출구에 있는 헤어스테이션   ?  버스로     잠실        법       75사단 동원훈련장    경로     
  치아교정   ~ 수원                 신촌 세브란스      첫차     갈현동  서울영상고등학교 (신정  ) 버스로    법...       먹골     버스가          구리      방법
     주변에 기타 수리받  수 있는곳          강남 삼성서울병원      버스가 뭐  ?..     강남   6번출구       gs마트 고양점   길  ~ 지하철 대화, 삼송,    첫차시간
약수     버스로  법 서울         야간버스 버스 706 번     정발산  (서울)      과천   지하철 타고 가면 차비가 얼마나...  서울 지하철            충청북도 증평군 증평읍...
   서 부평시장     법      디지털미디어단지서...
 12월31일이요       임진각 평화누리    방법   ...       갈현1동가려고  ...       노량진      버스 노선       서울   금천구시흥    빨리  법       맛집    치아교정 야간진료 어디  ? 
 마두       88오락실 불광  ,     ,   촌   근처 싼 피자집      ..^^        버스로 교대     법       국회의사당 가려면??       근처 신발세탁 고려대           스쿠터로   길      ~    
헌혈의집 인천연수동         버스로    방법    치과 추천해주세요!!      파주시 월롱면 영태리        ?  서울   쪽  천안갈려고   ,    수노래방 가격 서울   쪽에 중고폰가게   ? 
 9703    막차!  화정   녹번       부근 병원 성균관대         빨리  법       안산 중앙   버스로   법   ~!  고속터미널  어서      소요시간       낙성대   버스로   법이요~! 수색         갈려면    ？ 
평택   버스로   법  아현              버스       응암     막차   헌혈의집 평일 저녁에 가도          수원 영통입구     방법        치아교정 야간진료하는 곳 어디??
평택   버스로   방법 (서울)      (전북)함열      지하철 기차 타고  법      수영장      구로에 있는 고려대학병원   어케   ?... 불광동+    미아  빨리  법! 내공100!!!!!!!!!!!!!!!!!! 
     홍대       지하철로 잠실  (롯데월드)     방법  청주         법  ..       지하철타고 잠실학생수영장      ?        가산디지털단지     자전거로    방법     혹은 불광  근처  종각     한번에    버스..
성균관대  (과   )  안양이마트    가장빠른 교통수단...갈현1동 동사무소와     →두원공대 파주캠퍼스    루트...   다이어트 효과좋은 비만클리닉?!
       부천시청       치과 임플란트 하려고    공항버스    위치    쪽  분당에 죽전      빠르게    방법?    에 있는 주차장 제가       의왕     왔다갔다하는데    잠실  법 버스로 롯데월드몰   
 진관동       버스노선     메가박스센트럴  길    . 서울시 은평구       수원 영통구 망포동   길...   피부과    향남읍사무소    물빛공원    서울       김포 시립도서관    방법   
교정치과   !! 유진상가->녹번->불광->       찻길이 접하지 않은 곳  ...   치아교정 잘하는곳 추천  요      곤지암리조트   법          서대문      버스 번호   
은평구임플란트   임플란트 알아봐요    선정중학교   택시타고 가면 요금이 얼마정 교정치과 물어봅니당 놀만한 곳  서울 남부터미널 제가 2주택자이고 빌라, 중곡동...  수노래방 가격
 주엽  3호선을 타서 갈 지 주택조합 추진위원회라면서.  마곡나루  버스  주변  요실금 산부인과 좀? 불광 미광아파트 매매 질문좀...  로데오거리정류장 선정고 은평구 임플란트 주변   ... 
 독서실 무인 택배보관함 어디어디있는지 정발산  새절  or  수원  지하철 정기 치과 알아보는데요.  피부과 다녀와서 입니다 음식점겸술집을 오픈준비중  v r , 방탈출 카페 가격 할인 좀 
 서울  버스가는법...  , 불광동쪽  여의사산부인과  지식인님 !!   있는 아트박스   신촌연세병원 가는 버스.. 치아교정 믿음 가는 전문치과~ 치아교정 어떨까요? 새절 컴퓨터학원 자격증 준비반
 치아교정 믿을 수 있는 곳~ 남자머리 잘 자르는 곳  촌 치아교정 알아봐요! 쿠우쿠우 에뛰드  순정토너가 있나요? 집 노량진 어떻게 가요? 홍대입구 -> 막차 이대가는 법 좀 알려주세요 분당미금가는 버스
 피부과 말고요.. 상하치과 가보려구요. 피부과 보톡스 정량! 고양어울림누리 가는 방법 근처 렌트카 관련해서 질문합 망우    4번 출구 가는 방법.. 더헤어 탈색 더헤어 탈
 북한산성 쪽 가는 … 10월9일 한글날 다비치 … 룸술집or 조용한 술집 주택지 조합인가 요새 이거 때문 엔젤리너스 카페 치과 어디 갈까요?  집이 근처입니다 부천  근처
 치과 궁금해집니다~  내일 6호선 타고 월드컵경기 산부인과 알아보고 있는 중입니다. 치과 은평구 치아교정은? 치과 추천해주세요!!  치과 실력있는데로 찾아요! 치아교정 잘해주는곳?  인천공항 새벽 택시요금
 치과 다니시는 분들!  성남 상대원동 서울  구산  다이소  계란  삼송  or 경인중학교 치과 잘 알려주실 분 ^^ . 치과 정보 많이 아시면 근처 계곡 물품보관함 있나요? 판교  자전거 거래하는데
 치과 잘 아시는 분 서울 쪽 중고폰가게 있나요? 운전면허학원 궁금해요 수노래방 가격 전농동 이사비용 구파발, 쪽  있는 영어학원  강원도 양양 이사 견적 도그원  관한 질문 
 내 마음  든 안경집 다비치  은평구 운동장 근첩니다. 저 샤워기 있는 쪽 서울 흑석동 운송 비용이  광명사거리 가는 버스  은평구치과 유명한곳  치아교정 전문 어딘가요? 
 거주중입니다.  지 주택. 치아교정 어린이 잘 해주는 곳~ 피부과 발톱무좀 어떻하죠?  피부과 알려주세요 맛집 괜찮은 곳 추천 좀!  56사단가는법  피부과 주름개선화장품 
 치과 턱 아픈거 잘 봐주는 곳 좀 요!  혹시 일산 근처나 주변  고양 불광 가는방법.  피부과 홈케어 은평구( ) 실내낚시터 유명한곳  지식인님! 이거 인형  샀 오토바이 용달기사분구합니다 
 치아교정 물어봅니다!! 아직도 디팡 있나요?"""
 
 
    d = dict()
    for c in sentence.split():
        if c not in d:
            d[c]=1
        else:
            d[c]=d[c]+1

    d1 = dict()
    for key, value in d.iteritems():
        if value>4:
            d1[key]=value
            print key, value
            
def main():
    Bigdata()
    
if __name__=="__main__":
    main()